Troughput-Latency-tests/oneRmServiceTest/onerm_150.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 35.204.111.58 (be patient)


Server Software:        nginx/1.27.2
Server Hostname:        35.204.111.58
Server Port:            30001

Document Path:          /api/onermcalculator
Document Length:        23 bytes

Concurrency Level:      150
Time taken for tests:   1.918 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      252000 bytes
Total body sent:        421000
HTML transferred:       23000 bytes
Requests per second:    521.45 [#/sec] (mean)
Time per request:       287.658 [ms] (mean)
Time per request:       1.918 [ms] (mean, across all concurrent requests)
Transfer rate:          128.33 [Kbytes/sec] received
                        214.39 kb/s sent
                        342.71 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       47   57   7.0     55      85
Processing:    60  194  41.3    198     279
Waiting:       53  191  41.1    196     275
Total:        109  250  40.1    254     340

Percentage of the requests served within a certain time (ms)
  50%    254
  66%    266
  75%    272
  80%    277
  90%    306
  95%    315
  98%    322
  99%    327
 100%    340 (longest request)