Troughput-Latency-tests/oneRmServiceTest/onerm_200.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 35.204.111.58 (be patient)


Server Software:        nginx/1.27.2
Server Hostname:        35.204.111.58
Server Port:            30001

Document Path:          /api/onermcalculator
Document Length:        23 bytes

Concurrency Level:      200
Time taken for tests:   1.713 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      252000 bytes
Total body sent:        421000
HTML transferred:       23000 bytes
Requests per second:    583.83 [#/sec] (mean)
Time per request:       342.564 [ms] (mean)
Time per request:       1.713 [ms] (mean, across all concurrent requests)
Transfer rate:          143.68 [Kbytes/sec] received
                        240.03 kb/s sent
                        383.71 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       48   59   9.0     56      95
Processing:    51  235  49.0    243     308
Waiting:       48  232  49.1    240     307
Total:        102  293  47.8    299     378

Percentage of the requests served within a certain time (ms)
  50%    299
  66%    314
  75%    326
  80%    331
  90%    339
  95%    347
  98%    358
  99%    365
 100%    378 (longest request)