Troughput-Latency-tests/oneRmServiceTest/onerm_250.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 35.204.111.58 (be patient)


Server Software:        nginx/1.27.2
Server Hostname:        35.204.111.58
Server Port:            30001

Document Path:          /api/onermcalculator
Document Length:        23 bytes

Concurrency Level:      250
Time taken for tests:   2.333 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      252000 bytes
Total body sent:        421000
HTML transferred:       23000 bytes
Requests per second:    428.55 [#/sec] (mean)
Time per request:       583.367 [ms] (mean)
Time per request:       2.333 [ms] (mean, across all concurrent requests)
Transfer rate:          105.46 [Kbytes/sec] received
                        176.19 kb/s sent
                        281.65 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       45   62  15.4     55     111
Processing:    62  438 113.4    475     615
Waiting:       53  435 113.6    472     614
Total:        118  500 108.9    541     673

Percentage of the requests served within a certain time (ms)
  50%    541
  66%    565
  75%    576
  80%    584
  90%    595
  95%    602
  98%    632
  99%    648
 100%    673 (longest request)