Troughput-Latency-tests/oneRmServiceTest/onerm_30.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 35.204.111.58 (be patient)


Server Software:        nginx/1.27.2
Server Hostname:        35.204.111.58
Server Port:            30001

Document Path:          /api/onermcalculator
Document Length:        23 bytes

Concurrency Level:      30
Time taken for tests:   4.021 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      252000 bytes
Total body sent:        421000
HTML transferred:       23000 bytes
Requests per second:    248.68 [#/sec] (mean)
Time per request:       120.639 [ms] (mean)
Time per request:       4.021 [ms] (mean, across all concurrent requests)
Transfer rate:          61.20 [Kbytes/sec] received
                        102.24 kb/s sent
                        163.44 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       44   53   3.2     53      65
Processing:    48   63  12.3     60     324
Waiting:       47   60  12.2     57     320
Total:         95  116  13.3    113     378

Percentage of the requests served within a certain time (ms)
  50%    113
  66%    117
  75%    120
  80%    122
  90%    128
  95%    134
  98%    151
  99%    154
 100%    378 (longest request)