Troughput-Latency-tests/oneRmServiceTest/onerm_300.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 35.204.111.58 (be patient)


Server Software:        nginx/1.27.2
Server Hostname:        35.204.111.58
Server Port:            30001

Document Path:          /api/onermcalculator
Document Length:        23 bytes

Concurrency Level:      300
Time taken for tests:   2.148 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      252000 bytes
Total body sent:        421000
HTML transferred:       23000 bytes
Requests per second:    465.64 [#/sec] (mean)
Time per request:       644.279 [ms] (mean)
Time per request:       2.148 [ms] (mean, across all concurrent requests)
Transfer rate:          114.59 [Kbytes/sec] received
                        191.44 kb/s sent
                        306.03 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       46   64  18.3     56     120
Processing:    57  474 153.6    503     875
Waiting:       50  471 153.8    500     872
Total:        120  538 148.0    566     964

Percentage of the requests served within a certain time (ms)
  50%    566
  66%    604
  75%    616
  80%    626
  90%    693
  95%    718
  98%    879
  99%    917
 100%    964 (longest request)