Troughput-Latency-tests/oneRmServiceTest/onerm_40.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 35.204.111.58 (be patient)


Server Software:        nginx/1.27.2
Server Hostname:        35.204.111.58
Server Port:            30001

Document Path:          /api/onermcalculator
Document Length:        23 bytes

Concurrency Level:      40
Time taken for tests:   3.150 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      252000 bytes
Total body sent:        421000
HTML transferred:       23000 bytes
Requests per second:    317.49 [#/sec] (mean)
Time per request:       125.989 [ms] (mean)
Time per request:       3.150 [ms] (mean, across all concurrent requests)
Transfer rate:          78.13 [Kbytes/sec] received
                        130.53 kb/s sent
                        208.66 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       45   53   3.1     53      67
Processing:    50   66  12.8     62     126
Waiting:       48   63  12.8     59     123
Total:         97  119  14.0    115     181

Percentage of the requests served within a certain time (ms)
  50%    115
  66%    120
  75%    124
  80%    127
  90%    137
  95%    148
  98%    163
  99%    170
 100%    181 (longest request)